In [2]:
import pandas as pd

### Download the data and load it to Pandas. 

You can find them [here](https://drive.google.com/file/d/1NY6cmF9Shjw-dD7BD6bNmfcIVz-kQcFR/view?usp=sharing).

In [3]:
titles = pd.read_csv('data/titles.csv')
titles.head()

                     title  year
0           The Rising Son  1990
1  The Thousand Plane Raid  1969
2         Crucea de piatra  1993
3                  Country  2000
4               Gaiking II  2011

In [4]:
cast = pd.read_csv('data/cast.csv')
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4   NaN
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

### Using groupby(), count the number of films that have been released each decade in the history of cinema.

In [8]:
titles['decade'] = titles['year']-titles['year']%10

In [11]:
titles.groupby('decade')['year'].count()

decade
1890        3
1900       37
1910     6512
1920     8797
1930    10097
1940     8576
1950    12711
1960    17515
1970    18714
1980    20243
1990    22225
2000    38713
2010    67977
2020      210
Name: year, dtype: int64

### Use groupby() count the number of "Hamlet" films made each decade.

In [12]:
titles[titles['title']=="Hamlet"].groupby('decade')['year'].count()

decade
1910    3
1920    1
1940    1
1950    1
1960    2
1970    2
1980    1
1990    2
2000    2
2010    3
Name: year, dtype: int64

### How many leading (n=1) roles were available to actors, and how many to actresses, in each year of the 1950s?

In [20]:
cast['decade'] = cast['year']-cast['year']%10

In [21]:
cast[cast['decade'] == 1950].groupby(['year','type'])['year'].count()

year  type
1950  actor      16598
      actress     5545
1951  actor      17479
      actress     5844
1952  actor      16945
      actress     5781
1953  actor      16657
      actress     5755
1954  actor      13907
      actress     5050
1955  actor      14829
      actress     5455
1956  actor      15635
      actress     6202
1957  actor      15268
      actress     5869
1958  actor      14437
      actress     5474
1959  actor      13303
      actress     5437
Name: year, dtype: int64

### In the 1950s decade taken as a whole, how many total roles were available to actors, and how many to actresses, for each "n" number 1 through 5?

In [22]:
cast[(cast['decade'] == 1950) & (cast['n'].between(1,5,inclusive=True))].groupby(['year','type','n'])['year'].count()

year  type     n
1950  actor    1.0    626
               2.0    437
               3.0    506
               4.0    533
               5.0    557
                     ...
1959  actress  1.0    317
               2.0    482
               3.0    372
               4.0    311
               5.0    269
Name: year, Length: 100, dtype: int64

### Use groupby() to determine how many roles are listed for each of the Pink Panther movies.

In [26]:
cast[cast['title'].str.contains("Pink Panther")].groupby(['title'])['character'].count()

title
Curse of the Pink Panther          67
Revenge of the Pink Panther        64
Son of the Pink Panther            46
The Pink Panther                  111
The Pink Panther 2                 84
The Pink Panther Strikes Again     68
The Return of the Pink Panther     30
Trail of the Pink Panther          41
Name: character, dtype: int64

### List, in order by year, each of the films in which Frank Oz has played more than 1 role.

In [44]:
frank_oz = cast[cast['name'] == "Frank Oz"].groupby(['title','year']).count()
frank_oz[frank_oz['name']>1].sort_values('year')

                                           name  type  character  n  decade
title                                year
The Muppet Movie                     1979     8     8          8  8       8
An American Werewolf in London       1981     2     2          2  2       2
The Great Muppet Caper               1981     6     6          6  6       6
The Dark Crystal                     1982     2     2          2  2       2
The Muppets Take Manhattan           1984     7     7          7  7       7
Follow That Bird                     1985     3     3          3  3       3
The Muppet Christmas Carol           1992     7     7          7  7       7
Muppet Treasure Island               1996     4     4          4  4       4
Muppets from Space                   1999     4     4          4  4       4
The Adventures of Elmo in Grouchland 1999     3     3          3  3       3

### List each of the characters that Frank Oz has portrayed at least twice.

In [52]:
frank = cast[cast['name'] == 'Frank Oz'].groupby('character')['character'].count().reset_index(name="cnt")
frank[frank['cnt'] >= 2].sort_values('cnt')

         character  cnt
15          Grover    2
2             Bert    3
5   Cookie Monster    3
10     Fozzie Bear    4
25   Sam the Eagle    5
0           Animal    6
18      Miss Piggy    6
34            Yoda    6